# PhaseArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseArray Class
Members See Also
---
An array that contains phase objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PhaseArray : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class PhaseArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class PhaseArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PhaseArray
# See Also
PhaseArray Members
Autodesk.Revit.DB Namespace